#include <stdio.h>
#include <stdlib.h>

int main()
{
	int x,t,z,i,j, s[5];                                                  //宣告變數
	                                                                      
	printf("請輸入5個數字:");                                             //顯示文字
	for (z = 0; z < 5; z++)                                               //用for輸入陣列
		scanf_s("%d", &s[z]);                                             //從陣列的0~4位置

	for (i = 0; i < 5; i++)                                               //5個數最多只需要5次冒泡排序就能完成
	{
		if (!(s[4] > s[3] && s[3] > s[2] && s[2] > s[1] && s[1] > s[0]))  //判斷是否已經排序完成
		{
			for (j = 0; j < 4; j++)                                       //使用冒泡排序
			{
				if (s[j]>s[j + 1])										  //如果目前這位大於後方那位
				{
					t = s[j];											  //則將目前這位丟置暫存區
					s[j] = s[j + 1];                                      //用後方那位取代目前這位
					s[j + 1] = t;                                         //將暫存區的值取代後方那位
				}                                                         //完成交換的動作
			}

			for (x = 0; x < 5; x++)                                       //用for輸出這次排序完後的結果
				printf("%d  ", s[x]);
			printf("\n");                                                 //換行
		}
	}
	system("pause");                                                      //完成後按任一鍵關閉
	return 0;
}


